# -*- coding:utf-8 -*-
__author__ = 'Qiushi Huang'

"""
1、web1.0时代的网页制作
    网页制作是web1.0时代的产物，那个时候的网页主要是静态网页，
    静态网页就是没有与用户进行交互仅供读者浏览的网页，当时称为"牛皮癣"网页。类似：QQ日志、博文。
    在web1.0时代，用户能做的唯一事情就是浏览这个网站的文字图片内容，这时用户也不能像现在在大多数网站都可以评论交流（缺乏交互性）
    “网页三剑客 Dreamweaver+Fireworks+Flash”吧，这个组合就是web1.0时代的产物
    
2、web2.0时代的前端开发
    在web 2.0时代，网页有静态网页和动态网页。
    所谓动态网页，就是用户不仅仅可以浏览网页，还可以与服务器进行交互。
    web2.0时代的网页不仅包含炫丽的动画、音频和视频，还可以让用户在网页中进行评论交流、上传和下载文件等（交互性）。
    现在网站开发无论是开发难度，还是开发方式上，都更接近传统的网站后台开发，所以现在不再叫“网页制作”，而是叫“web前端开发”。

3、web前端能做什么？
    公司官网、移动端网页、移动APP、微信小程序等。

4、为什么要学习前端开发？
    Python全栈开发，不仅要掌握后端开发的技术还要掌握一定程度的前端开发技术。 

5、前端开发有哪些内容？
    网页最主要由3部分组成：结构、表现和行为。网页现在新的标准是W3C，目前模式是HTML、CSS和JavaScript。
    结构对应html；
    表现对应CSS;
    行为对应JavaScript
    
6、上面这三部分都是做什么的？
    （1）HTML是什么？
    HTML，全称“Hyper Text Markup Language（超文本标记语言）”，简单来说，网页就是用HTML语言制作的。
    HTML是一门描述性语言，是一门非常容易入门的语言。
    （2）CSS
    css，全称"层叠样式表"，只要提到说"层叠样式表"、"css样式"，都是指的CSS。
    （3）JavaScript
    JavaScript是一门脚本语言。
    （4）HTML、CSS和JavaScript的区别 我们都知道前端技术最核心的是HTML、CSS和JavaScript这三种。但是这三者究竟是干嘛的呢？
    同第五点所描述的相同，“HTML是网页的结构，CSS是网页的外观，而JavaScript是页面的行为。

把前端开发的过程比喻成“建房子”，做一个网页就像盖一栋房子，先把房子结构建好（HTML）。
建好房子之后给房子装修（CSS），例如往窗户安上窗帘、往地板铺上漂亮的瓷砖。
最后呢，装修完了之后，当夜幕降临的时候，我们要开灯（JavaScript），这样才能看得见里面。

"""