# -*- coding:utf-8 -*-
__author__ = 'Qiushi Huang'

# HTML是一个网页的主体部分，也是一个网页的基础。因为一个网页可以没有样式，可以没有交互，但是必须要有网页需要呈现的内容。所以HTML部分是整个前端的基础。
"""
HTML，全称是超文本标记语言（HyperText Markup Language），它是一种用于创建网页的标记语言。
标记语言是一种将文本（text）以及文本相关的其他信息结合起来，展现出关于文档结构和数据处理细节的计算机文字编码。
与文本相关的其他信息（包括例如文本的结构和表示信息等）与原来的文本结合在一起，但是使用标记（markup）进行标识

标记语言既描述了文档本身的信息（问题内容和回答的情况）也描述了文档的结构和各部分的作用。
而HTML则是世界通用的、用于描述一个网页的信息的标记语言，我们使用的浏览器具有将HTML文档渲染并展示给用户的功能

带尖括号的这些东西是标签，标签描述了文本的作用，比如p标签表示其内部的文本是一个段落，a标签标识内部的文本是超链接等；与此同时，通过标签的互相嵌套，表示了这个文档的结构。

HTML作为标记语言没有什么逻辑，就是一些有意义的符号。
"""

"""
开发环境：Hbuild、Sublime Text、Dreamweare都可以用来开发html,pycharm也支持html开发。

文件后缀规范：一般使用.html或.htm，两者都是静态网页后缀名。
"""